[
    {
        "id": "q001",
        "text": "You need to register an app for embedding Power BI content. You are thinking of using an account which does not have a Power BI Pro license. Will it work for you?\n\n",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 1
    },
    {
        "id": "q002",
        "text": "You have created a line visual that displays the number of students getting scholarships over time. Now, you are interested in seeing the total scholarship cost of the students when you hover over a data point. Which of the following are the possible options to accomplish this goal?\n\n",
        "images": [],
        "choices": [
            "Add a Scholarship_amount to the Tooltips",
            "Add a Scholarship_amount to the drill through fields",
            "Add a Scholarship_amount to the Visual Filters",
            "None of the above"
        ],
        "correct": 0
    },

    {
        "id": "q003",
        "text": "Which of the following chart is the great choice to identify or display the outliers?\n\n",
        "images": [],
        "choices": ["Line Chart", " Scatter Chart", "Bar chart", "Donut chart"],
        "correct": 1
    },
    {
        "id": "q004",
        "text": "You need to create a report that will demonstrate the sales performance of the company. The sales team has requested you to add a single visualization (if possible) that might help them in identifying the factors that drive the sales and affect the success.   Which of the following visualization would you use?\n\n",
        "images": [],
        "choices": [
            "Key influencers",
            "Funnel chart",
            "Donut Chart",
            "Q&A visualization"
        ],
        "correct": 0
    },
    {
        "id": "q005",
        "text": "Which of the following is not the feature of the Lineage view in Power BI?\n\n",
        "images": [],
        "choices": [
            "It allows the users to troubleshoot the flow of data from its source to its destination",
            "It allows the users to manage the workspaces and analyze the impact of a single change in one dataset to dashboards and reports",
            "It simplifies the task of identifying the dashboards and reports that haven‘t been refreshed",
            " It helps in analyzing the data sets and finding the patterns, trends, and outliers"
        ],
        "correct": 3
    },

    {
        "id": "q006",
        "text": "You need to create Power BI reports which are to be deployed to Power BI Report Server. Which of the following tools would you use?\n\n",
        "images": [],
        "choices": [
            "Power BI Desktop",
            "Power BI Desktop optimized for Report Server",
            "Power BI desktop optimized for Paginated reports",
            "Power BI Report Builder"
        ],
        "correct": 1
    },

    {
        "id": "q007",
        "text": "Which of the following might be the possible considerations for using the \u0093Add Column From Examples\u0094 feature in the query editor?\n\n",
        "images": [],
        "choices": [
            "You\u0092re sure about the data that you need in your new column, but you are not sure about the transformation or set of transformations, that will get you the same",
            "You\u0092re confirmed about all the transformations that you need using a Custom Column expression in M language, but one (or more) of these expressions are not available in the UI",
            "You\u0092re sure about the transformations that you need, but you are not sure what to choose in the UI to let them happen",
            "All the above"
        ],
        "correct": 3
    },
    {
        "id": "q008",
        "text": "Select the types from the below-given list which is not valid in the M Programming language?\n\n",
        "images": [],
        "choices": ["DataFrame", "List", "Record", "Table", "Type", "Function"],
        "correct": 0
    },
    {
        "id": "q009",
        "text": "Consider the below given Power BI model.\n\n This model shows the relationship of Product table with Product category on column SKU.\nHere is the sample of the data that both the tables have:\nProduct Table\nSKU: E-01, Product: Lenovo Ideapad Slim 5i, Color: Grey\nSKU: E-02, Product \u0096 Sony headset, Color: Red\nSKU: E-03, product- Samsung TVs , Color : Black\nProduct Category\nSKU: E-01, Category: laptops\nSKU: E-02, Category: Headsets\nSKU: E-03, category: Televisions\nIn your Power BI report, you need to create a Hierarchy that demonstrates two levels i.e. Product and Category.\nSolution: From Power Query, merge the tables and then create the hierarchy.\nWill the given solution help in achieving the goal?",
        "images": ["q009"],
        "choices": ["True", "False"],
        "correct": 0
    },

    {
        "id": "q010",
        "text": "You have a custom connector that returns email-ID, From, To, Body and attachments for each email sent in a specified year and more than 10 million records have been returned by this connector. Your manager has asked you to build a report to analyze the internal network of employees depending upon whom they send mails to. Also, the report recipients should not be able to read the analyzed emails. The solution is supposed to minimize the size of the model. What would you do?",
        "images": [],
        "choices": [
            "Implement row-level security to allow the report recipients to only to view the results depending upon the emails they sent",
            "During the import, Remove the columns Subject and Body",
            "Through Model view, set the columns Subject and Body to Hidden",
            "Implementing Dynamic row-level security"
        ],
        "correct": 1
    },

    {
        "id": "q011",
        "text": "There is a product dataset with the columns Unit_Price and ordered_quantity. You have been asked to build a visualization that displays the relationship between Unit_Price and Ordered_Quantity and the orders having similar unit price and ordered_quantity should be highlighted. Which of the following visualization and feature would you use?",
        "images": [],
        "choices": [
            "Visualization: A column chart for Unit_Price and Quantity_ordered by year and Feature: Automatically finds clusters",
            "Visualization: A column chart for Unit_Price and Quantity_ordered by year and Feature: Find where the distribution is different",
            "Visualization: A scatter Plot for Unit_price and Quantity_ordered by item and Feature: Automatically Finds Clusters",
            "Visualization: A scatter Plot for Unit_price and Quantity_ordered by item and Feature: Find where the distribution is different",
            "Visualization: A Line chart for Unit_Price and Quantity_ordered by year and Feature: Automatically Finds Clusters"
        ],
        "correct": 2
    },
    {
        "id": "q012",
        "text": "Select the correct Power BI report settings that you can customize with the help of a report theme?\n\n",
        "images": [],
        "choices": [
            "Background color for the report",
            "Set of the custom colors that are utilized by the visuals throughout the report",
            "Default features of the new visuals which are included in the report",
            "All of these"
        ],
        "correct": 3
    },
    {
        "id": "q013",
        "text": "You are developing a visual to demonstrate the ranking of the product types by sales revenues. As per your company‘s security policies, you can‘t send the data outside of your Power BI tenant. Which of the following approach would provide the widest variety of visuals while sticking to the security policies?\n\n",
        "images": [],
        "choices": [
            "Using only the default visuals",
            "Using default or custom visuals from the .pbiviz file",
            "Using default visuals or custom visuals from the marketplace",
            "Using default visuals or certified custom visuals"
        ],
        "correct": 3
    },

    {
        "id": "q014",
        "text": "You are creating a complex report having a lot of visuals in Power BI. You want to ensure that the users read it in a logical way when they use the keyboard. From the following list, select the right option which you need to work on.\n\n",
        "images": [],
        "choices": [
            "Page Order",
            "Tab Order",
            "Layer Order",
            "Field Hierarchy",
            "Bookmark Order"
        ],
        "correct": 1
    },

    {
        "id": "q015",
        "text": "Multistring,Which of the following are the potential ways to enhance the performance of a report?\n\n",
        "images": [],
        "choices": [
            "Aggregate the data to reduce the number of rows. For example, the transactions can be grouped by the month rather than showing them by date",
            "Restrict the number of data points shown in a visual for example in a table with the help of the Top N filter",
            "C. Optimize the DAX expressions to iterate through fewer rows",
            "Split out the dimensions and associated attributes into their own tables minimizing the number of columns within a fact tables",
            "Reduce the number of bookmarks applied to a report.",
            "Which of the following are the potential ways to enhance the performance of a report?\n\n"
        ],
        "correct": 0
    },
    {
        "id": "q016",
        "text": "There is a dataset containing the survey results for the percentage of Facebook usage by Gender, year, and age.  The age of the survey respondents lies between 10 and 70 years. You need to build a bar chart demonstrating the percentage of Facebook usage for equal age ranges of 15 years.\nHere is the list of some actions that might be performed.\na. Set the group type to Bin\nb. Set the Bin size to 4\nc. Set the Bin Count to 15\nd. Set the Bin count to 4\ne. Set Group type to list\nf. Set the Bin type to the number of Bins\ng. Right-click on the column Age and Choose New Group\nChoose the correct sequence of the actions (you may choose some or all actions from the given list) that you would perform.",
        "images": [],
        "choices": [
            "a-b-c-f-g",
            "a-c-b-g-h",
            "a-b-c-e-g",
            "g-a-f-d",
            "a-g-f-d"
        ],
        "correct": 3
    },
    {
        "id": "q017",
        "text": "Multistring, Which of the below-given settings are possible to be managed in a dataset in Power BI Service?\n\n",
        "images": [],
        "choices": [
            "Adding a new data source",
            "Adding a new DAX measure",
            "Configure Scheduled Refreshes",
            "View the refresh history",
            "Creating a new table relationship",
            "If you are not the current owner, you can take over the dataset."
        ],
        "correct": 2
    },

    {
        "id": "q018",
        "text": "Multistring, You develop a Power BI Report for a huge dataset. You are looking to enhance the performance of dataset refresh through an incremental refresh. Which of the following statements are true regarding this scenario?\n\n",
        "images": [],
        "choices": [
            "Use Incremental Refresh feature only for the data sources supporting query folding",
            "RangeStart and RangeEnd are two PowerQuery parameters that are needed for the incremental Refresh",
            "Use Incremental Refresh feature for all data sources",
            "A date field is needed on a table in the dataset"
        ],
        "correct": 0
    },

    {
        "id": "q019",
        "text": "Consider the below given Power BI model.This model shows the relationship of the Product table with the Product category on column SKU.\nHere is the sample of the data that both the tables have:\nProduct Table\nSKU: E-01, Product: Lenovo Ideapad Slim 5i, Color: Grey\nSKU: E-02, Product Sony headset, Color: Red\nSKU: E-03, product- Samsung TVs, Color: Black\nProduct Category\nSKU: E-01, Category: laptops\nSKU: E-02, Category: Headsets\nSKU: E-03, category: Televisions\nYou need to utilize a Hierarchy in your Power BI report that demonstrates two levels i.e product and category.\nTo achieve the goal, you decide to create a DAX expression with the CONCATENATEX function between the Product and Category columns.\nWill it really help you in achieving the goal?",
        "images": [],
        "choices": ["True", "False"],
        "correct": 1
    },
    {
        "id": "q020",
        "text": "You can create some very powerful data analysis solutions with the help of measures. Which of the following statement is true about the measures in Power BI? \n\n",
        "images": [],
        "choices": [
            "A new measure can be created by clicking the New Measure button present in the Home tab of Power BI Desktop",
            "A measure can be referenced in a DAX expression by writing the bracket",
            "Whenever you do interact with the report, the context in which the measure calculates and shows its results changes",
            "All of the above"
        ],
        "correct": 3
    },
    {
        "id": "q021",
        "text": "What does Assume Referential Integrity mean in Power BI Desktop while developing the relationships between the tables?\n\n",
        "images": [],
        "choices": [
            "Setting Assume referential integrity makes queries utilize INNER JOIN statements instead of OUTER JOIN, which increases the query efficiency",
            "It considers that there are no null or blank values in any data table in the relationships",
            "It automatically considers the relationship as one to one (instead of one to many or many to one)",
            "It permits the calculated columns to be considered as the relationship column between the tables",
            "Setting Assume referential integrity makes queries to utilize OUTER JOIN statements instead of INNER JOIN, which increases the query efficiency"
        ],
        "correct": 0
    },

    {
        "id": "q022",
        "text": "Multistring, You have a Consumer Sales Revenue monthly report. You analyze and notice that the attrition Rate metric is sharply increased.\nYou are interested in understanding the variables that might affect this result.\nWhich of the following visuals can you use to understand and explore the potential causes in Power BI Desktop?",
        "images": [],
        "choices": [
            "Decomposition tree visuals",
            "Funnel Visual",
            "Key Influencer Visual",
            "Combo visual",
            "Waterfall Visual"
        ],
        "correct": 0
    },

    {
        "id": "q023",
        "text": "You have the responsibility to configure the Microsoft Power BI dashboard. You need to add the feature that the users of the dashboard can provide you with feedback and that feedback should be visible to the other users of the dashboard? In this case, what would you use?\n\n",
        "images": [],
        "choices": [
            "Comments",
            "Mark as favorite",
            "Subscribe",
            "Feedback",
            "Bookmark"
        ],
        "correct": 0
    },
    {
        "id": "q024",
        "text": "There is a dashboard named Salary_Cost having Q&A enabled on it.  When a user tries to get the count of Employees, the query gets failed. On the other hand,  when the user asks for the count of workers, the query returns the expected result.\nYou need to ensure that the same result is returned by both queries. Which of the following actions would you perform?",
        "images": [],
        "choices": [
            "Editing synonyms from  the  Power BI service",
            "Editing Relationships from the Power BI Desktop",
            "Editing synonyms from the Power BI Desktop",
            "Editing tables from the Power Query in Power BI Desktop"
        ],
        "correct": 2
    },
    {
        "id": "q025",
        "text": "You need to import a dataset into the Power BI Desktop from an Excel document. While performing the tables profiling, you notice that two columns require some fixings where Column1 is having many values starting with space and column2 is having a number of non-printable characters.\nWhich of the following commands can help you in fixing the errors in Column1 and Column2?",
        "images": [],
        "choices": [
            "Column1: Capitalize Each Word Column2: Clean",
            "Column1: Clean White Spaces Column2: Trim",
            "Column1: Clean White Spaces Column2: Clean",
            "Column1: Length Column2: TRIM",
            "Column1: Trim Column2: Clean",
            "Column1: Capitalize Each Word Column2: Trim"
        ],
        "correct": 4
    },

    {
        "id": "q026",
        "text": "Consider the statement below: Queries in the Query editor don´t need to be loaded to the data model. You can decide and select whether to load them or not.",
        "images": [],
        "choices": ["True", "False"],
        "correct": 0
    },

    {
        "id": "q027",
        "text": "Consider the two tables Courses and Teachers with the following snapshots\n\n You desire to set a relationship between the tables courses and teachers with many-to-one cardinality, but it is not available in the relationship settings (as demonstrated in the below picture).\n\n",
        "images": [],
        "choices": [
            "Use the “Remove Errors“ command for the Courses table",
            "Filter out the blank values from the Teachers table",
            "Add a new index column Teacher Name to the table Courses",
            "Use the “Remove Duplicates“ command for the Teachers table",
            "Use the “Remove Duplicates“ command for the Courses table"
        ],
        "correct": 1
    },
    {
        "id": "q028",
        "text": "What is the use of Row Level Security (RLS) in Power BI?\n\n",
        "images": [],
        "choices": [
            "Assigning the security permissions for the underlying Power BI Azure SQL Database",
            "Adding the ability to link Power BI Log-in to organizational Active Directory or Window Login through Single Sign On (SSO)",
            "Restricting data access for the given users ( By assigning users to roles)",
            "Restrictions to specific measures within Power BI reports to some specific users",
            "All the above"
        ],
        "correct": 2
    },
    {
        "id": "q029",
        "text": "Choose the correct return type for the FILTER function in DAX.\n\n",
        "images": [],
        "choices": ["Row", "Column", "Table", "Integer", "Character"],
        "correct": 2
    },

    {
        "id": "q030",
        "text": "Consider that you want to split your query into two parts. Which of the following options would you use in Power BI?\n\n",
        "images": [],
        "choices": [
            "Format Query",
            "Split Query",
            "Extract previous",
            "Mark Query"
        ],
        "correct": 1
    },

    {
        "id": "q031",
        "text": "You need to create some visualizations in Power BI Desktop using Python Scripting. After installing and configuring Python for Power BI Desktop, you run the below-given code:\n\n In the response, you get the following error message.\n\n How would you fix this issue?\n\n",
        "images": [],
        "choices": [
            "By refreshing the IDE settings",
            "By adding the command pyplot.show to the script",
            "By refreshing the dataset origin connection",
            "How would you fix this issue?\n\n"
        ],
        "correct": 1
    },
    {
        "id": "q032",
        "text": "You are publishing a report to Consumer Services Workspace. The report basically identifies the consumers having data quality problems that need to be investigated by the consumer services department of the company. You want to allow the consumer service managers to create the task lists in Microsoft Excel depending upon the data. How would you configure the report setting?\n\n",
        "images": [],
        "choices": [
            "Modify the default visual interaction from cross highlighting to cross-filtering",
            "Dont permit the end users to save filters on the report",
            "Permit the users to include the comments in the report",
            "Enable the modified filter pane and display the filters in the visual header of the report",
            "Select the type of data you want to allow the end-users to export"
        ],
        "correct": 4
    },
    {
        "id": "q033",
        "text": "Multistring, Which of the following are the benefits of Power BI Reports over Power BI Dashboards?\n\n",
        "images": [],
        "choices": [
            "Report offers storytelling capability with the help of bookmarks",
            "Reports offer a better real-time experience while showing data from a streaming dataset",
            "Report definitions are possible to save using PBIX, an external file format, and checked into source control",
            "Reports offer a better interactive drill down and filtering experience",
            "Reports update automatically whenever the data of the underlying dataset is updated"
        ],
        "correct": 0
    },

    {
        "id": "q034",
        "text": "Your team manager has asked you to print some Power BI reports and distribute them among the team members during the Review meeting. Before starting the printing of reports, you notice that some tables are showing fewer rows as compared to the actual rows present there. Which of the following is the right method to resolve this issue?\n\n",
        "images": [],
        "choices": [
            "Change the visual from the table to Matrix",
            "Create a paginated report",
            "Create a customize tooltip",
            "Reduce the table size by grouping the rows",
            "Expand the table to the whole page"
        ],
        "correct": 1
    },

    {
        "id": "q035",
        "text": "For the custom column Formula:\n            =if[state]= LA then Los Angeles else[state]\nSelect the statement that rightly describes the value for the custom column formula.",
        "images": [],
        "choices": [
            "The value of the formula will be “Los Angeles“",
            "The value of the formula will be “LA“",
            "The value of the formula will either be “Los Angeles“ or whatever the value for the State column is",
            "The value of the formula will be the same value as the State column"
        ],
        "correct": 2
    },
    {
        "id": "q036",
        "text": "You work for a Bike company and create a report of Sales and Category. You build a measure for the Sales % of Categories and want to add conditional formatting such that the colors for low values are red, center values are orange and high values are green.\nHow would you achieve this goal?",
        "images": [],
        "choices": [
            "Use conditional formatting with a Color scale using default settings",
            "Use conditional formatting with Rules",
            "Use conditional formatting with a Color scale and check the diverging setting",
            "Use conditional formatting with Field values"
        ],
        "correct": 2
    },
    {
        "id": "q037",
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.You have a clustered bar chart that contains a measure named Salary as the value and a field named Employee as the axis. Salary is present in the data as a numerical amount representing US dollars.You need to create a reference line to show which employees are above the median salary.Solution: You create an average line by using the Salary measure.Does this meet the goal?\n\n",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 1
    },

    {
        "id": "q038",
        "text": "What is the purpose of a dataset in Power BI?\n\n",
        "images": [],
        "choices": [
            "To store data",
            "To create reports",
            "To share data",
            "To manage data sources"
        ],
        "correct": 0
    },

    {
        "id": "q039",
        "text": "What is the purpose of a data type in Power BI?\n\n",
        "images": [],
        "choices": [
            "To define the format and behavior of a column",
            "To define the format and behavior of a measure",
            "To define the format and behavior of a visualization",
            "To define the format and behavior of a report"
        ],
        "correct": 0
    },
    {
        "id": "q040",
        "text": "Multistring, You have a report that contains four pages. Each page contains slicers for the same four fields.Users report that when they select values in a slicer on one page, the selections are not persisted on other pages.You need to recommend a solution to ensure that users can select a value once to filter the results on all the pages.What are two possible recommendations to achieve this goal? Each correct answer presents a complete solution.NOTE: Each correct selection is worth one point.\n\n",
        "images": [],
        "choices": [
            "Create a bookmark for each slicer value.",
            "Replace the slicers with report-level filters.",
            "Sync the slicers across the pages.",
            "Replace the slicers with page-level filters.",
            "Replace the slicers with visual-level filters."
        ],
        "correct": 1
    },
    {
        "id": "q041",
        "text": "What is the best way to organize datasets in Power BI?\n\n",
        "images": [],
        "choices": [
            "Use folders to group related datasets",
            "Use tags to categorize datasets",
            "Use a naming convention to identify datasets",
            "Use a separate workspace for each dataset"
        ],
        "correct": 0
    },

    {
        "id": "q042",
        "text": "You have a line chart that shows the number of employees in a department over time.You need to see the total salary costs of the employees when you hover over a data point.What should you do?\n\n",
        "images": [],
        "choices": [
            "Add salary to the drillthrough fields.",
            "Add salary to the visual filters.",
            "Add salary to the tooltips."
        ],
        "correct": 2
    },

    {
        "id": "q043",
        "text": "What is the purpose of the Power BI Q&A feature?\n\n",
        "images": [],
        "choices": [
            " To allow users to ask natural language questions and get answers in the form of visualizations\n",
            " To allow users to create custom visuals\n",
            " To allow users to share reports with others\n",
            "To allow users to create dashboards"
        ],
        "correct": 0
    },
    {
        "id": "q044",
        "text": "How can you create a drill-through report in Power BI?\n\n",
        "images": [],
        "choices": [
            " Use the Drillthrough feature in the Power BI Desktop\n",
            " Use the Drillthrough feature in the Power BI Service\n",
            " Use the Drillthrough feature in the Power BI Mobile App\n",
            " Use the Drillthrough feature in Excel\n"
        ],
        "correct": 0
    },
    {
        "id": "q045",
        "text": "In a sales report, which chart type would be best to show the total sales for each product category?\n\n",
        "images": [],
        "choices": ["Pie chart", "Bar chart", "Line chart", "Scatter chart"],
        "correct": 1
    },

    {
        "id": "q046",
        "text": "Multistring, How can you manage workspaces in Power BI?\n\n",
        "images": [],
        "choices": [
            " Create a new workspace\n",
            " Delete a workspace\n",
            " Rename a workspace\n",
            " Share a workspace\n"
        ],
        "correct": 0
    }
]
