[
    {
        "id": "q001",
        "text": "Consider the Power BI model shown in the picture. [IMAGE HERE] The Product Table has a relationship to the Product Category Table on the SKU column. Here, you can check a sample of data inside the tables: Product Table: SKU: HD-001, Product: GymSmartwatch, Color: Blue SKU: HD-002, Product: XSound Headphones, Color: Black SKU: HD-003, Product: Laptop Pro 2000, Color: Green Product Category Table: SKU: HD-001, Category: Smartwatch SKU: HD-002, Category: Headphone SKU: HD-003, Category: Computer You need to use in your Power BI report a Hierarchy that shows two levels: product and category. Solution: Create a DAX expression that uses CONCATENATEX function between the Product column and the Category column. Does this solution meet the goal?",
        "images": ["q001.png"],
        "choices": ["No", "Yes"],
        "correct": 0
    },
    {
        "id": "q002",
        "text": "Suppose you have a Power BI model based on the following two tables: Enrollments (columns name: Enrollments_ID, Enrollments_amount, DateID), Date (columns name: DateID, Date, Month, Week, Year). There is an active relationship between Enrollments and Date. You want to create a measure to calculate the Enrollments for the same period from the previous year. Select the right DAX formula.",
        "images": [],
        "choices": [
            "SUM(Enrollments[Enrollments_amount]) / CALCULATE(SUM(Enrollments[Enrollments_amount]), SAMEPERIODLASTYEAR('Date'[Date]))",
            "SUM(Enrollments[Enrollments_amount]) - CALCULATE(Enrollments[Enrollments_amount]), DATESYID('Date'[Date]))",
            "CALCULATE(SUM(Enrollments[Enrollments_amount]), SAMEPERIODLASTYEAR('Date'[Date]))",
            "CALCULATEx(SUM(Enrollments[Enrollments_amount]), DATEADD('Date'[Date], -1, YEAR))"
        ],
        "correct": 2
    },
    {
        "id": "q003",
        "text": "Consider the following two tables: Sales (columns: SalesID, OrderDate, Salesman), Date (columns: Date, Month, Week, Year) There is a relationship between Sales[OrderDate] and Date[Date]. Suppose you want to create a goal for the number of sales made in the current year and set it as 10% higher than the number of sales made in the previous year. Select the proper order of the DAX functions to complete correctly the following formula: [IMAGE HERE] ",
        "images": ["q003.png"],
        "choices": [
            "CALCULATE - COUNT - PREVIOUSYEAR",
            "COUNTX - FORMAT - DATEADD",
            "CALCULATE - SUMX - PREVIOUSYEAR",
            "COUNT - CALCULATE - SAMEPERIODLASTYEAR"
        ],
        "correct": 0
    },
    {
        "id": "q004",
        "text": "You plan to create a DAX formula to filter the total enrollments of the 2019 year. How should you complete the formula shown in the picture, in order to effectively use it apart from the other date filter set on the report page? [IMAGE HERE] ",
        "images": ["q004.png"],
        "choices": ["ALL", "FORMAT", "VALUES", "ALLEXCEPT"],
        "correct": 0
    },
    {
        "id": "q005",
        "text": "You plan to create a measure named YTDPreviousEnrollments that will be used in a table visualization. YTDPreviousEnrollments must show the year-to-date (YTD) enrollment amount of the previous year for the same month. Check the picture for a sample of the desired data: [IMAGE HERE] Select the proper order of DAX formula targets that calculate the YTDPreviousEnrollments. [IMAGE HERE] ",
        "images": ["q005.png", "q005_2.png"],
        "choices": [
            "CALCULATE - TOTALYTD",
            "CALCULATE - DATEADD",
            "CALENDAR - DATEADD",
            "FILTER - DATEDIFF"
        ],
        "correct": 1
    },
    {
        "id": "q006",
        "text": "Consider the table named Enrollments shown in the picture: [IMAGE HERE] You need to create the following measure:  Total Enrollments This Year = SUM([Enrollments]) Suppose you want to compare the current yearly enrollments to the previous year by another measure. Complete the following DAX formula with the right targets:[image here]",
        "images": ["q006.png", "q006_2.png"],
        "choices": [
            "SUMX - PREVIOUSYEAR",
            "DATEADD - CALCULATE",
            "CALCULATE- DATEADD",
            "CALCULATE - SAMEPERIODLASTYEAR"
        ],
        "correct": 2
    },
    {
        "id": "q007",
        "text": "You have a Power BI model for sales data. You create a measure to calculate the year-to-date sales. You need to compare the year-to-date sales with the previous year for the same time period. Which DAX function should you use?",
        "images": [],
        "choices": ["DATEADD", "ENDOFYEAR", "TOTALYTD", "DATESYTD"],
        "correct": 0
    },
    {
        "id": "q008",
        "text": "You have a Power BI model that contains two tables named Enrollments and Date. Enrollments table contains three columns named EnrollmentsAmount, EnrollmentDate and EnrollmentID. You want to create a measure to sum the last 12 months of enrollments. Note: you have to start from the last date an enrollment was made and reject any filters set on the report. Select the proper order of the DAX functions to complete correctly the following formula: [IMAGE HERE]",
        "images": ["q008.png"],
        "choices": [
            "ALLEXCEPT - DATEADD",
            "CALCULATE - DATESYTD",
            "DATEADD - LASTNONBLANK",
            "CALCULATE - DATEADD"
        ],
        "correct": 2
    },
    {
        "id": "q009",
        "text": "You want to see the sum of the Sales[SalesAmount] for the Contoso brand by creating a new Quick Measure. How you are supposed to set the following fields? [image here]",
        "images": ["q009.png"],
        "choices": [
            "Calculation: Running totals, Base Value: Count of Sales Amount, Field: Contoso, Direction: Ascending",
            "Calculation: Filtered Value, Base Value: Count of Sales Amount, Filter: BrandName, Select a value: Contoso",
            "Calculation: Running totals, Base Value: Sum of Sales Amount, Field: Contoso, Direction: Ascending",
            "Calculation: Filtered Value, Base Value: Sum of Sales Amount, Filter: BrandName, Select a value: Contoso"
        ],
        "correct": 3
    },
    {
        "id": "q010",
        "text": "Consider the tables shown in the picture: [image here ] You need to create a new table that displays the top 5 Students by the total of attended courses. Select the proper order of the DAX functions to complete correctly the following formula: [image here]",
        "images": ["q010.png", "q010_2.png"],
        "choices": [
            "CALCULATE - TOPN",
            "CALCULATE - VALUES",
            "FILTER - RANKX",
            "CALCULATE - RANKX"
        ],
        "correct": 0
    },
    {
        "id": "q011",
        "text": "Consider the table Product_Sales shown in picture 1: [image here] You need to create a measure to rank total sales by product as shown in picture 2. [image here] Which of the following DAX formulas should you use?",
        "images": ["q011.png", "q011_2.png"],
        "choices": [
            "RANKX(ALL('Product_Sales'), [SalesAmount],,DESC, Dense)",
            "RANKX([Product], [SalesAmount],,DESC, Dense)",
            "RANKX(ALL('Product_Sales' [Product]), [SalesAmount],,DESC, Skip)",
            "RANKX(ALL('Product_Sales'), [SalesAmount], Asc)"
        ],
        "correct": 0
    },
    {
        "id": "q012",
        "text": "You want to create a bar chart visualization to show the count of course enrollments by year that have an Enrollments Amount greater than 1,000. You need to create a measure that will be used in the bar chart visualization. Select the proper order of the DAX functions to complete correctly the following formula: [image here] ",
        "images": ["q012.png"],
        "choices": [
            "COUNT - VALUE",
            "COUNTROWS-FILTER",
            "CALCULATE - COUNT",
            "CALCULATE - FILTER"
        ],
        "correct": 1
    },
    {
        "id": "q013",
        "text": "You are creating appointment schedules for your clients. Consider the following data from a query named Appointments: [image here] You need to visualize the data as shown in the following picture by using a matrix visualization: [image here] Select the proper order of DAX formula targets which allows you to create the measure that will display the checkboxes. [image here] ",
        "images": ["q013.png", "q013_2.png", "q013_3.png"],
        "choices": [
            "COUNTX - UPPER",
            "COUNTROWS-UNICHAR",
            "SUM - LOWER",
            "CALCULATE - UNICHAR"
        ],
        "correct": 1
    },
    {
        "id": "q014",
        "text": "You are modeling data by using Microsoft Power Bl. Part of the data model is a large Microsoft SQL Server table named [Fact Internet Sales] that has more than 500 million records. During the development process, you need to import a sample of the data from the [Fact Internet Sales] table. Solution:  You add a report-level filter that filters based on the [Fact Internet Sales] date. Does this meet the goal?",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 1
    },
    {
        "id": "q015",
        "text": "You need to configure the visual as shown below [image here] What will you add to the visual?",
        "images": ["q015.png"],
        "choices": [
            "a measure",
            "a trendline",
            "a forecast",
            "an Average line"
        ],
        "correct": 2
    },
    {
        "id": "q016",
        "text": "You have a table that contains sales data and approximately 1,500 rows. You need to identify outliers in the table. Which type of visualization should you use?",
        "images": [],
        "choices": ["area chart", "donut chart", "scatter plot", "pie chart"],
        "correct": 2
    },
    {
        "id": "q017",
        "text": "You create the following step by using Power Query Editor = Table.ReplaceValue(SalesLT_Address,”1318″,”1319″,Replacer.ReplaceText,{“AddressLine1”}) A row has a value of 21318 Lasalle Street in the AddressLine1 column. What will the value be when the step is applied?",
        "images": [],
        "choices": [
            "1319",
            "21319 Lasalle Street",
            "1318",
            "21318 Lasalle Street"
        ],
        "correct": 1
    },
    {
        "id": "q018",
        "text": "What is the benefit of using a report tooltip?",
        "images": [],
        "choices": [
            "To give users additional information about a report visual, such as the author name and modified date",
            "To provide additional detail that is specific to the context of the data that is being hovered over.",
            "To give users the ability to export data from the visual."
        ],
        "correct": 1
    },
    {
        "id": "q019",
        "text": "You need to create a visualization that compares revenue and cost over time. Which type of visualization should you use?",
        "images": [],
        "choices": [
            "stacked area chart",
            "donut chart",
            "line chart",
            "waterfall chart"
        ],
        "correct": 2
    },
    {
        "id": "q020",
        "text": "What does the decomposition tree not enable you to do?",
        "images": [],
        "choices": [
            "Conduct root cause analysis to understand a measure better.",
            "Conduct what-if analysis with built-in parameters.",
            "Automatically analyze selected dimensions to find where a measure is highest or lowest."
        ],
        "correct": 1
    },
    {
        "id": "q021",
        "text": "You have a report that contains a bar chart and a column chart. The bar chart shows customer count by customer segment. The column chart shows sales by month. You need to ensure that when a segment is selected in the bar chart, you see which portion of the total sales for the month belongs to the customer segment. How should the visual interactions be set on the column chart when the bar chart is selected?",
        "images": [],
        "choices": ["filter", "Highlight", "No impact"],
        "correct": 1
    },
    {
        "id": "q022",
        "text": "Where can you configure and set data alerts?",
        "images": [],
        "choices": [
            "Data alerts can be set only in Power BI service on specific visuals such as KPI cards, gauges, and cards.",
            "Data alerts can be set only in Power BI desktop on specific visuals such as KPI cards, gauges, and cards.",
            "Data alerts can be set only in Power BI desktop and Power BI service on specific visuals such as KPI cards, gauges, and cards."
        ],
        "correct": 0
    },
    {
        "id": "q023",
        "text": "You have sales data in a star schema that contains four tables named Sales, Customer, Date, and Product. The Sales table contains purchase and ship dates. Most often, you will use the purchase date to analyze the data, but you will analyze the data by both dates independently and together. You need to design an imported dataset to support the analysis. The solution must minimize the model size and the number of queries against the data source. Which data modeling design should you use?",
        "images": [],
        "choices": [
            "On the Date table, use a reference query in Power Query and create active relationships between Sales and both Date tables in the modeling view.",
            "Duplicate the Date query in Power Query and use active relationships between both Date tables.",
            "Use the Auto Date/Time functionality in Microsoft Power BI and do NOT import the Date table.",
            "Create an active relationship between Sales and Date for the purchase date and an inactive relationship for the ship date."
        ],
        "correct": 3
    },
    {
        "id": "q024",
        "text": "You have a clustered bar chart that contains a measure named Salary as the value and a field named Employee as the axis. Salary is present in the data as a numerical amount representing US dollars. You need to create a reference line to show which employees are above the median salary. Solution: You create an average line by using the Salary measure. Does this meet the goal?",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 1
    },
    {
        "id": "q025",
        "text": "You have a clustered bar chart that contains a measure named Salary as the value and a field named Employee as the axis. Salary is present in the data as a numerical amount representing US dollars. You need to create a reference line to show which employees are above the median salary. Solution: You create a percentile line by using the Salary measure and set the percentile to 50%. Does this meet the goal?",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 0
    },
    {
        "id": "q026",
        "text": "You have a clustered bar chart that contains a measure named Salary as the value and a field named Employee as the axis. Salary is present in the data as a numerical amount representing US dollars. You need to create a reference line to show which employees are above the median salary. Solution: You create a constant line and set the value to .5. Does this meet the goal?",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 1
    },
    {
        "id": "q027",
        "text": "What visual should be used to display outliers?",
        "images": [],
        "choices": ["line chart", "scatter chart", "clustered column chart"],
        "correct": 1
    },
    {
        "id": "q028",
        "text": "You are modeling data by using Microsoft Power Bl. Part of the data model is a large Microsoft SQL Server table named [Fact Internet Sales] that has more than 500 million records. During the development process, you need to import a sample of the data from the [Fact Internet Sales] table. Solution: You add a WHERE clause to the SQL statement. Does this meet the goal?",
        "images": [],
        "choices": ["Yes", "No"],
        "correct": 0
    },
    {
        "id": "q029",
        "text": "What can be achieved by removing unnecessary rows and columns?",
        "images": [],
        "choices": [
            "Deleting unnecessary rows and columns will reduce a dataset size and its good practice to load only necessary data into your data model.",
            "It is not necessary deleting unnecessary rows and columns and it is a good practice to keep all metadata intact.",
            "Deleting unnecessary rows and columns can damage the structure of the data model."
        ],
        "correct": 0
    },
    {
        "id": "q030",
        "text": "You're creating a Power BI report with data from an Azure Analysis Services Cube. When the data refreshes in the cube, you would like to see it immediately in the Power BI report. How should you connect?",
        "images": [],
        "choices": ["Import", "Donnect Live", "Direct Query"],
        "correct": 1
    },
    {
        "id": "q031",
        "text": "Your company plans to completely separate development and production assets such as datasets, reports, and dashboards in Microsoft Power Bl. You need to recommend an application lifecycle strategy. The solution must minimize maintenance to update access and prevent end-users from viewing the development assets. What should you recommend?",
        "images": [],
        "choices": [
            "Create one workspace for development. From the workspace, publish an app for production",
            "Create separate workspaces for development and production. Grant the end users access to the production workspace",
            "In the same workspace, create separate copies of the assets and append DEV to the names of the copied assets. Grant the end users access to the workspace",
            "Create production reports in a separate workspace that uses a shared dataset from the development workspace. Grant the end users access to the production workspace"
        ],
        "correct": 1
    },
    {
        "id": "q032",
        "text": "You have a data model that contains many complex DAX expressions. The expressions contain frequent references to the RELATED and RELATEDTABLE functions. You need to recommend a solution to minimize the use of the RELATED and RELATEDTABLE functions. What should you recommend?",
        "images": [],
        "choices": [
            "Split the model into multiple models",
            "Hide unused columns in the model",
            "Merge tables by using Power Query.",
            "Transpose"
        ],
        "correct": 2
    },
    {
        "id": "q033",
        "text": "You have the following three versions of an Azure SQL database: * Test * Production * Development You have a dataset that uses the development database as a data source. You need to configure the dataset so that you can easily change the data source between the development, test, and production database servers from powerbi.com. What will you do?",
        "images": [],
        "choices": [
            "Create a parameter and update the queries to use the parameter",
            "Create a query for each database server and hide the development tables.",
            "Set the data source privacy level to Organizational and use the ReplaceValue Power Query M function.",
            "Create a JSON file that contains the database server names. Import the JSON file to the dataset"
        ],
        "correct": 0
    },
    {
        "id": "q034",
        "text": "You have worked hard to create a clean dataset of all your companys customer details, including address and geocode. The Senior Director in your division has asked that all people within your company are aware of the high-quality, authoritative customer dataset that meets all the companys standards. How can you achieve this goal?",
        "images": [],
        "choices": [
            "Select Promote content",
            "Ask authorized reviewers to Certify your content",
            "Select Featured content on home",
            "Create a new workspace with the high-quality data and add the entire company as members"
        ],
        "correct": 1
    },
    {
        "id": "q035",
        "text": "You create several Power Bl report pages. You need to make the report pages more interactive for users. To answer, drag the appropriate Power Bl feature for the stated requirement. “Share feedback on visuals with other users”",
        "images": [],
        "choices": ["Buttons", "Selection pane", "Bookmarks", "Comments"],
        "correct": 3
    }
]
