[
    {
        "id": "q001",
        "text": "As part of a large Bl project, you have created a new dashboard for consumption by the HR team. After opening the Get Data menu option and selecting SQL Server, you are not sure which Data Connectivity mode to select. If you want the data to automatically refresh as you interact with visualizations which option should you choose?",
        "images": [],
        "choices": [
          "Import",
          "DirectQuery"
        ],
        "correct": 1
    },
    {
        "id": "q002",
        "text": "You are analyzing data quality on a set of data that you imported with Power Query. You need to use the correct Data Preview options to analyze the data. Which Data Preview option should you use to find the below data quality issue? “Find the number of distinct and unique rows for all columns”",
        "images": [],
        "choices": [
          "Column quality",
          "Monospaced",
          "Column profile",
          "Column distribution",
          "Show whitespace"
        ],
        "correct": 3
    },
    {
        "id": "q003",
        "text": "You plan to use dataflows to perform extract, transform, and load processing on data stored in the Common Data Service to prepare it for Power Bl reports. You need to set up the dataflows to process and store data. Which components should you use for the following process? “Create dataflows using….”",
        "images": [],
        "choices": [
          "Azure Data Factory",
          "DAX",
          "Power Query"
        ],
        "correct": 2
    },
    {
        "id": "q004",
        "text": "You are a business intelligence analyst for a worldwide organization. You create a Power Bl report that shows sales for your organization. You need to provide a version of the report that filters the data for a single country. Solution: 1) Add a parameter to the dataset for country. 2) Add a query parameter specifying the parameter and country. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "No",
          "Yes"
        ],
        "correct": 1
    },
    {
        "id": "q005",
        "text": "You import an HR dataset into Power Bl Desktop. You need to find distinct and unique rows for each column in a dataset appearing in a single view, as shown below.",
        "images": ["q005.png"],
        "choices": [
          "Column distribution",
          "Column profile",
          "Column quality",
          "Custom column"
        ],
        "correct": 0
    },
    {
        "id": "q006",
        "text": "Power Query emphasizes making changes using which of the following?",
        "images": [],
        "choices": [
          "Formula bar",
          "Server",
          "Graphical user interface (GUI)",
          "Command line"
        ],
        "correct": 2
    },
    {
        "id": "q007",
        "text": "You use the Power Bl Desktop to prepare data. You examine data quality in Power Query. You need to discover anomalies in the data. Which option should you use?",
        "images": [],
        "choices": [
          "Column distribution",
          "Data connectivity mode",
          "Column profile",
          "Column quality"
        ],
        "correct": 2
    },
    {
        "id": "q008",
        "text": "You import sales data using Power Query to apply a series of transformation steps after the query has been executed. There are errors, as shown in the below exhibit for Cells.",
        "images": ["q008.png"],
        "choices": [
          "use the Remove Errors feature",
          "use the Replace Errors feature",
          "Remove the column."
        ],
        "correct": 1
    },
    {
        "id": "q009",
        "text": "You are analyzing data quality on a set of data that you imported with Power Query. You need to use the correct Data Preview options to analyze the data. Which Data Preview option should you use to find the below data quality issue? “Find the number of distinct, unique, and empty rows for a single column”",
        "images": [],
        "choices": [
          "Column distribution",
          "Column quality",
          "Monospaced",
          "Show whitespace",
          "Column profile"
        ],
        "correct": 4
    },
    {
        "id": "q010",
        "text": "Your company’s product data is held in an Azure SQL Server database. Your company has an endorsed dataset available in the Power Bl service that contains the company’s product catalog and sales data in a common model that standardizes how product data is reported. You use Power BI Desktop to create reports. You need to create a new report on product data that is consistent with the standardized data.What should you do?",
        "images": [],
        "choices": [
          "Create a new local dataset connecting to the Azure SQL database",
          "Create a new .pbix file and use Power Bl dataflows to connect to the endorsed dataset",
          "Edit a .pbix file with an existing connection to the Azure SQL database and connect to the endorsed dataset",
          "Create a new .pbix file and connect to the endorsed dataset"
        ],
        "correct": 3
    },
    {
        "id": "q011",
        "text": "Overview: You work for a company that uses Power Bl for financial reporting. Analysis and insights for sales are now required. Existing Environment: Power Bl service is used and workspaces have been created. Power Bl Desktop is installed. Data Sources: Sales data is stored in an Azure SQL database. Dimension data for Territory and Country is held in an Excel workbook in SharePoint Online. Sales schema – The schema for the sales data is shown in the Schema exhibit. Product Ids are alphanumeric and consist of three letters followed by three numbers. The Sales amount is net of any taxes The Tax rate is 20 percent on all sales. Territory workbook – The data for territories is shown in the Territory workbook exhibit. Issues: You observe the following issues: The labels for the country are not consistent for territories. The labels used are not the commonly used names in your company. The labels do not follow naming corporate standards with capitalization, no special characters, and no abbreviations. Users must be able to analyze sales by product type. The tax amount on sales must be available in visualizations. Sales managers are unable to create visualizations for sales grouped by Product type. Sales managers must only be able to see sales for their territory. /Table/ QUESTION  You need to make sure that the labels for the country are consistent. What should you do?",
        "images": ["q011.png"],
        "choices": [
          "Apply the Convert to a List transform to the Country column.",
          "Apply the Replace Values transform to the Country column.",
          "Apply the Remove duplicates transform to the Country column.",
          "Set the Data category to Country."
        ],
        "correct": 1
    },
    {
        "id": "q012",
        "text": "Multi = 0 & 2 / You use Power BI Desktop to prepare data. You import a set of data using Power Query. You need to identify whether a column contains only unique values. Which two Data preview options can you use to meet your goal? Each correct answer presents a complete solution.",
        "images": [],
        "choices": [
          "Column profile",
          "Column quality",
          "Column distribution",
          "Monospaced"
        ],
        "correct": 0
    },
    {
        "id": "q013",
        "text": "What can you accomplish with a data gateway?",
        "images": [],
        "choices": [
          "Download Report",
          "Report Publish",
          "View Report",
          "Refresh Data"
        ],
        "correct": 3
    },
    {
        "id": "q014",
        "text": "You create a dataset using multiple data sources that contain similar tables. You need to reduce the number of tables in the dataset to make the data model simpler and the creation of visuals easier. Which method should you use to combine the tables for the below scenario? Select the appropriate method. Scenario: Multiple tables with the same columns containing data for each month",
        "images": [],
        "choices": [
          "Combine Files",
          "Merge Queries",
          "Append Queries"
        ],
        "correct": 2
    },
    {
        "id": "q015",
        "text": "When using the “Split Column by Delimiter” transformation, which option may result in more than two new columns?",
        "images": [],
        "choices": [
          "None of these",
          "At the right-most delimiter",
          "At the left-most delimiter",
          "At each occurrence of the delimiter."
        ],
        "correct": 3
    },
    {
        "id": "q016",
        "text": "Overview: You work for a company that uses Power Bl for financial reporting. Analysis and insights for sales are now required. Existing Environment: Power Bl service is used and workspaces have been created. Power Bl Desktop is installed. Data Sources: Sales data is stored in an Azure SQL database. Dimension data for Territory and Country is held in an Excel workbook in SharePoint Online. Sales schema – The schema for the sales data is shown in the Schema exhibit. Product Ids are alphanumeric and consist of three letters followed by three numbers. The Sales amount is net of any taxes The Tax rate is 20 percent on all sales. Territory workbook – The data for territories is shown in the Territory workbook exhibit. Issues:# You observe the following issues: The labels for country are not consistent for territories. The labels used are not the commonly used names in your company. The labels do not follow naming corporate standards with capitalization, no special characters, and no abbreviations. Users must be able to analyze sales by product type. The tax amount on sales must be available in visualizations. Sales managers are unable to create visualizations for sales grouped by Product type. Sales managers must only be able to see sales for their territory. /Table/ QUESTION You need to be able to show the amount of tax in visualizations. You use Power Query. Which three actions should you perform in sequence? Select the order in which the possible steps needs to be performed. Possible steps: 1) Add a custom column named Tax to Sales 2) Pivot the Amount column. 3) Set the formula to be [Amount]/5  4) Duplicate the Amount column. 5) Change the Data Type to Decimal number.",
        "images": ["q016.png"],
        "choices": [
          "Step 1 > 3 > 5",
          "Step 4 > 3 > 5",
          "Step 2 > 1 > 5",
          "Step 1 > 5 > 3"
        ],
        "correct": 0
    },
    {
        "id": "q017",
        "text": "You create a Power Bl report using an Excel workbook stored on OneDrive for Business as the data source in Power Bl Desktop. You need to replace the Excel workbook with a new version that contains updated data. For the following statement(s), select Yes if the statement is true. Otherwise, select No. “The Excel workbook can be edited in Power BI”",
        "images": [],
        "choices": [
          "Yes",
          "No"
        ],
        "correct": 1
    },
    {
        "id": "q018",
        "text": "You create a Power Bl report using an Excel workbook stored on OneDrive for Business as the data source in Power Bl Desktop. You need to replace the Excel workbook with a new version that contains updated data. For the following statement(s), select Yes if the statement is true. Otherwise, select No. “The Excel workbook must have the same file path and name as the original workbook.”",
        "images": [],
        "choices": [
          "No",
          "Yes"
        ],
        "correct": 1
    },
    {
        "id": "q019",
        "text": "You use Power Bl to create visualizations of the financial data in the below exhibit. /Table/ You need to create a measure for the average profit for products for use in visualizations. You need to ensure that the measure you create will behave correctly when used with CALCULATE functions. How should you create the measure? To answer, select the appropriate measure.",
        "images": ["q019.png"],
        "choices": [
          "Average Product Profit = SUMMARIZE(CALCULATE(VALUES('financials'[Product])), CALCULATE(KEEPFILTERS('financials'[Profit]))",
          "Average Product Profit = AVERAGEX(KEEPFILTERS(VALUES('financials'[Product])), CALCULATE(AVERAGE('financials'[Profit]))",
          "Average Product Profit = FILTER(AVERAGE(VALUES('financials'[Product])), CALCULATE(ALL('financials'[Profit]))",
          "Average Product Profit = AVERAGE(KEEPFILTERS(VALUES('financials'[Product])), CALCULATE(ALL('financials'[Profit]))",
          "Average Product Profit = CALCULATE(AVERAGE(VALUES('financials'[Product])), CALCULATE(KEEPFILTERS('financials'[Profit]))"
        ],
        "correct": 1
    },
    {
        "id": "q020",
        "text": "You create a dataset and a report that contain several visuals in Power Bl. The dataset uses the DirectQuery storage mode. Users complain of performance issues when using visuals on the Power Bl report. You need to optimize the report. What should you do?",
        "images": [],
        "choices": [
          "Switch off interactions between visuals.",
          "Turn off single select under Slicers.",
          "Change the cross filter directions on relationships to 30th.",
          "Use the CALCULATE DAX function with filters to define measures."
        ],
        "correct": 0
    },
    {
        "id": "q021",
        "text": "Multi = 0 & 2 / You have tables named Employee and Region. These tables are connected through an active relationship using the RegionlD column. A group of employees can be assigned to a single region. You configure row-level security (RLS) for a Power Bl report so regional managers can only see the data of assigned employees. You need to fix the relationship between the Employee and Region tables so RLS can work. Which two actions should you perform? Each correct answer presents part of the solution.",
        "images": [],
        "choices": [
          "Select Apply security filter in both directions",
          "Set the Cross filter direction option to Single.",
          "Set the Cross filter direction option to Both.",
          "Set cardinality to one-to-one between the Employee to Region tables."
        ],
        "correct": 0
    },
    {
        "id": "q022",
        "text": "You create a data model and report in Power Bl desktop. The report runs well in the development environment, but when deployed to production, the model and report have performance issues. You need to improve the model’s performance. Solution: Summarize the data & create aggregations. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "Yes",
          "No"
        ],
        "correct": 0
    },
    {
        "id": "q023",
        "text": "Multi = 0 & 3 / You have a table of Purchase Orders (POs), a sample of which is shown in the exhibit. /Table/ There are relationships with other tables on the PO Number, PO Date, and Vendor columns. You need to optimize model performance. Which two actions should you perform? Each correct answer presents part of the solution.",
        "images": ["q023.png"],
        "choices": [
          "Remove the PO prefix from the PO Number column and change the data type to Whole Number.",
          "Change the format of the PO Amount column to Currency.",
          "Mark the Purchase Orders table as the date table.",
          "Add a new column to the Purchase Order table and perform a lookup to set the Vendor Id from Vendor column."
        ],
        "correct": 0
    },
    {
        "id": "q024",
        "text": "You load sales data into Power BI. Your organization uses many different terms for sales data such as revenue, net sales, and total sales. You need to configure the Sales table and its columns for users to successfully use the Q&A feature in Dashboards.Solution: Manage aggregations on the Sales table. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "No",
          "Yes"
        ],
        "correct": 0
    },
    {
        "id": "q025",
        "text": "You are configuring row level security (RLS) roles for a Power Bl report. You need to define which rows are available when creating a role. What should you create?",
        "images": [],
        "choices": [
          "DAX expression",
          "Parameter",
          "Measure",
          "M formula"
        ],
        "correct": 0
    },
    {
        "id": "q026",
        "text": "You have tables named Calendar and Transactions as shown in the below exhibits. 'Transactions' /Table/ 'Calendar' /Table/ The Transactions table has a column named Sales that contains the sales value of each transaction. The Sales column summarization property is set to Don’t summarize. You need to calculate year-to-date sales using a quick measure. How should you complete the measure as per the below quick measure setup fields?",
        "images": [["q026_1.png", "q026_2.png", "q026_3.png"]],
        "choices": [
          "Calculation: year-to-date total Base value: Sum of Sales Date: Date",
          "Calculation: Sales Base value: year-to-date total Date: [Calendar].[Day]",
          "Calculation: year-to-date total Base value: Sales Date: [Calendar].[Day]",
          "Calculation: Sum of Sales Base value: Sales Date: Date",
          "Calculation: year-over-year change Base value: Sum of Sales Date: Date"
        ],
        "correct": 0
    },
    {
        "id": "q027",
        "text": "Multi = 1 & 3 / You plan to create a report in Power Bl for a manufacturing company. The company purchases parts and assemblies finished products. The company works from Monday to Friday and is closed on holidays. You have a date table created using DAX functions from the dates in the Productlnventory table. The schema for the tables is shown in the below exhibit. /Table/ You plan to create a visual that shows the trend over time of inventory levels for both parts and finished products on the last production day each month. You need to create a measure to determine the inventory level for the visual. Which two DAX functions can you use to meet the requirements? Each correct answer presents a complete solution.",
        "images": ["q027.png"],
        "choices": [
          "CALCULATE (SUM(Productlnventory[lnventory Count] ), FILTER(Productlnventory, Productlnventory[lnventory Count] = MAX(Productlnventory[lnventory Count] )))",
          "CALCULATE (SUM ( Productinventory[lnventory Count]), LASTNONBLANK ( Productlnventory[Date], SUM(Productlnventory[lnventory Count]) ))",
          "CALCULATE (SUM ( Productinventory[lnventory Count]), LASTDATE ( DateTable[Date] ))",
          "CALCULATE (SUM ( Productinventory[lnventory Count]), LASTDATE ( Productinventory[Date] ))",
          "CLOSINGBALANCEMONTH (SUMX( Productinventory, [Inventory Count]), Productinventory[Date] )"
        ],
        "correct": 1
    },
    {
        "id": "q028",
        "text": "You have an Orders table that contains two date columns: OrderDate and ShippingDate, as shown in the below exhibit. /Table/ A Date table has two relationships to the orders table for the two date fields. The relationship on the OrderDate column is the active relationship. You need to create visualizations that display the total price of orders for each quarter based on both the OrderDate and the ShippingDate columns. How should you create the measure for sales by shipping date?",
        "images": ["q028.png"],
        "choices": [
          "Sales by Shipping Date = SUMX(CALCULATE(Orders[Price]), USERELATIONSHIP(Orders[ShippingDate], 'Date'[Date]))",
          "Sales by Shipping Date = SUM(CALCULATE(Orders[Price]), USERELATIONSHIP(Orders[ShippingDate], 'Date'[Date]))",
          "Sales by Shipping Date = CALCULATE(SUM(Orders[Price]), RELATED(Orders[ShippingDate], 'Date'[Date]))",
          "Sales by Shipping Date = CALCULATE(SUM(Orders[Price]), USERELATIONSHIP(Orders[ShippingDate], 'Date'[Date]))",
          "Sales by Shipping Date = SUMX(CALCULATE(Orders[Price]), RELATED(Orders[ShippingDate], 'Date'[Date]))"
        ],
        "correct": 3
    },
    {
        "id": "q029",
        "text": "Overview: Company1 Pharmaceuticals develops, manufactures, and supplies healthcare products. Company1 has annual reporting requirements including a balance sheet, income statement, and a profit and loss report for the previous year with projections tor the current year. The reporting within the financial system is limited and does not meet the Company’s requirements. Historically, producing these statements and reports has taken significant manual effort that was error-prone, and it has not been possible to perform useful analysis on financial data. Planned Changes: Power BI service and Power BI Desktop will be used to generate financial reports, statements, and analysis tor financial data. Data Sources: The finance system holds all financial data including sales and expenses. The finance system holds the chart of accounts. The finance system stores its data in an on-premises SQL Server. Sales prediction and budget plans are stored in Excel workbooks in SharePoint Online. Reporting Requirements: The following information should be produced: > Income trend > Expenditure trend > Comparison of income and expenditure for the current year with the previous year > Comparison of planned income and expenditure for next year with the current year. Users should also be able to: > Drill down on data by country and territory. > Drill down using the chart of accounts structure. > Use the Q&A feature of Power BI. Security Requirements: C level executives should have access to all analysis. Country and Territory managers should only have access to data for their country/territory. /4Tales/ Question: You are planning to configure the relationship between the Chart of Accounts and Predicted Sales to meet the security requirements. You need to be able to apply the security filter in both directions. What should you do?",
        "images": ["q029_1.png", "q029_2.png", "q029_3.png", "q029_4.png"],
        "choices": [
          "Set the cross filter direction to Both.",
          "Set the cardinality to One to many from Chart of Accounts to Predicted Sales.",
          "Set the cross filter direction to Single.",
          "Select the Make this relationship active option."
        ],
        "correct": 0
    },
    {
        "id": "q030",
        "text": "You load sales data into Power BI. Your organization uses many different terms for sales data such as revenue, net sales, and total sales. You need to configure the Sales table and its columns for users to successfully use the Q&A feature in Dashboards. Solution: Add Synonyms to the Sales table. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "No",
          "Yes"
        ],
        "correct": 1
    },
    {
        "id": "q031",
        "text": "You create a data model and report in Power Bl desktop. The report runs well in the development environment, but when deployed to production, the model and report have performance issues. You need to improve the model’s performance. Solution: Remove columns from the data model not used in reports. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "Yes",
          "No"
        ],
        "correct": 0
    },
    {
        "id": "q032",
        "text": "You are building a Power Bl data model. There are multiple management levels in your organization. You have an Employee table with the columns shown in the below exhibits. 'Employee Data' /Table1/ 'Employee Table' /Table2/ There is a self-join, one-to-many relationship on this table between Managerld and Employeeld. You need to be able to see all levels of the management hierarchy and be able to create visualizations that show data at each level of the hierarchy. Which three actions should you perform in sequence?",
        "images": [["q032_1.png", "q032_2.png"]],
        "choices": [
          "1. Use the PATHITEM DAX function to extract the management levels. 2. Use the PATH DAX function to extract a text column containing all the hierarchy of employee ids. 3. Create a new hierarchy and add the management levels.",
          "1. Use the COMBINEVALUES DAX function to create a text column containing the manager id and employee id. 2. Create a new hierarchy and add the management levels. 3. Create a hierarchy on the Employeeld and add the Managerld as the second level in the hierarchy.",
          "1. Use the PATH DAX function to extract a text column containing all the hierarchy of employee ids. 2. Use the PATHITEM DAX function to extract the management levels. 3. Create a new hierarchy and add the management levels.",
          "1. Use the PATH DAX function to extract a text column containing all the hierarchy of employee ids. 2. Use the PATHITEM DAX function to extract the management levels. 3. Create a hierarchy on the Employeeld and add the Managerld as the second level in the hierarchy."
        ],
        "correct": 2
    },
    {
        "id": "q033",
        "text": "You load sales data into Power BI. Your organization uses many different terms for sales data such as revenue, net sales, and total sales. You need to configure the Sales table and its columns for users to successfully use the Q&A feature in Dashboards. Solution: Set the row label on the Sales table. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "No",
          "Yes"
        ],
        "correct": 1
    },
    {
        "id": "q034",
        "text": "Multi = 0 & 3 / You are creating a report of financial transactions showing monthly trends. The source transaction table has an excess of 10 million rows. You need to optimize the report’s performance. Which two actions should you perform? Each correct answer presents part of the solution.",
        "images": [],
        "choices": [
          "Create a summary table in the data source with the transaction data grouped by month.",
          "Set the Storage mode on the transactions table to DirectQuery.",
          "Create all visualizations on a single report page.",
          "Set the Storage mode on the transactions table to Import."
        ],
        "correct": 0
    },
    {
        "id": "q035",
        "text": "You create a Power Bl report containing several visuals. Users report performance issues when using visuals on the Power Bl report. You need to identify which visuals are taking the longest to process. Which five actions should you perform in sequence? To answer, select the appropriate actions in the correct order.",
        "images": [],
        "choices": [
          "1. Start Query Diagnostics. 2. Enable tracing in Diagnostic Options. 3. Start recording in Performance Analyzer. 4. Run Azure Speed Test. 5. Restart Power Bl Desktop.",
          "1. Restart Power Bl Desktop. 2. Enable tracing in Diagnostic Options. 3. Add a blank report page. 4. Run Azure Speed Test. 5. Stop recording and review the results.",
          "1. Add a blank report page. 2. Restart Power Bl Desktop. 3. Start recording in Performance Analyzer. 4. Interact with the visuals. 5. Stop recording and review the results.",
          "1. Restart Power Bl Desktop. 2. Start Query Diagnostics. 3. Interact with the visuals. 4. Run Azure Speed Test. 5. Stop recording and review the results."
        ],
        "correct": 2
    },
    {
        "id": "q036",
        "text": "Overview: Company1 Pharmaceuticals develops, manufactures, and supplies healthcare products. Company1 has annual reporting requirements including a balance sheet, income statement, and a profit and loss report for the previous year with projections tor the current year. The reporting within the financial system is limited and does not meet the Company’s requirements. Historically, producing these statements and reports has taken significant manual effort that was error-prone, and it has not been possible to perform useful analysis on financial data. Planned Changes: Power BI service and Power BI Desktop will be used to generate financial reports, statements, and analysis tor financial data.\nData Sources:\nThe finance system holds all financial data including sales and expenses. The finance system holds the chart of accounts. The finance system stores its data in an on-premises SQL Server. Sales prediction and budget plans are stored in Excel workbooks in SharePoint Online. Reporting Requirements: The following information should be produced: > Income trend > Expenditure trend > Comparison of income and expenditure for the current year with the previous year > Comparison of planned income and expenditure for next year with the current year. Users should also be able to: > Drill down on data by country and territory. > Drill down using the chart of accounts structure. > Use the Q&A feature of Power BI. Security Requirements: C level executives should have access to all analysis. Country and Territory managers should only have access to data for their country/territory. /4Tables/ Question: You need to create a table containing unique countries, and a table of unique combinations of countries and territories. Which DAX expressions should you use? To answer, select the appropriate options from the drop-down menus.",
        "images": [["q036_1.png", "q036_2.png", "q036_3.png", "q036_4.png"]],
        "choices": [
          "Country = VALUES('Predicted Sales'[Account Number]) Territory = SUMMARIZE('Predicted Sales', [Territory], [Account Number])",
          "Country = VALUES('Predicted Sales'[Territory]) Territory = SUMMARIZE('Country', [Territory], [Account Number])",
          "Country = DATATABLE('Predicted Sales'[Country]) Territory = SUMMARIZE('Predicted Sales', [Territory], [Country])",
          "Country = VALUES ('Predicted Sales'[Country]) Territory = SUMMARIZE('Predicted Sales', [Territory], [Country])",
          "Country = VALUES('Predicted Sales'[Country]) Territory = DISTINCT('Predicted Sales', [Territory], [Country])"
        ],
        "correct": 3
    },
    {
        "id": "q037",
        "text": "You create a data model and report in Power Bl desktop. The report runs well in the development environment, but when deployed to production, the model and report have performance issues. You need to improve the model’s performance. Solution: Hide the columns in the data model. Does this solution meet the goal?",
        "images": [],
        "choices": [
          "Yes",
          "No"
        ],
        "correct": 1
    },
    {
        "id": "q038",
        "text": "You work on the optimization of a Power Bl report. The report has a table named Calendar and a table named Transactions as shown in the below exhibits. /Table/ The report uses a measure named [Sales YOY % Growth] to calculate year over year sales growth. The report also has a measure named [Sales] that calculates sales for a selected period. The measure definitions are as follows: Sales = SUM(Transactions [Sales]) Sales YOY % Growth = DIVIDE([Sales] – CALCULATE([Sales], SAMEPERIODLASTYEAR(‘Calendar'[Date])), CALCULATE([Sales], SAMEPERIODLASTYEAR(‘Calendar'[Date]))) You need to re-write the [Sales YOY % Growth] measure to improve report performance. To answer select the appropriate option of DAX measure.",
        "images": ["q038.png"],
        "choices": [
          "Sales YOY % Growth = VAR SalesPrevYear = CALCULATE([Sales], PARALLELPERIOD('Calendar'[Date]) RETURN DIVIDE(([Sales] - SalesPrevYear), SalesPrevYear)",
          "Sales YOY % Growth = VAR PrevYearSales = CALCULATE([Sales], PARALLELPERIOD(SAMEPERIODLASTYEAR) RETURN DIVIDE(([Sales] - SalesPrevYear), SalesPrevYear)",
          "Sales YOY % Growth = VAR SalesPrevYear = CALCULATE([Sales], SAMEPERIODLASTYEAR('Calendar'[Date]) RETURN DIVIDE(([Sales] - SalesPrevYear), SalesPrevYear)",
          "Sales YOY % Growth = VAR PrevYearSales = CALCULATE([Sales], SAMEPERIODLASTYEAR('Calendar'[Date]) RETURN DIVIDE(([Sales] - SalesPrevYear), SalesPrevYear)"
        ],
        "correct": 2
    },
    {
        "id": "q039",
        "text": "You are designing a data model for a non-profit organization. Which entity should you use to store information about donations?",
        "images": [],
        "choices": [
          "A. Donation",
          "B. Donor",
          "C. Fundraiser",
          "D. Volunteer"
        ],
        "correct": 0
    },
    {
        "id": "q040",
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.You are modeling data by using Microsoft Power BI. Part of the data model is a large Microsoft SQL Server table named Order that has more than 100 million records.During the development process, you need to import a sample of the data from the Order table.Solution: You add a WHERE clause to the SQL statement.Does this meet the goal?",
        "images": [],
        "choices": [
          "A. Yes",
          "B. No"
        ],
        "correct": 0
    },
    {
        "id": "q041",
        "text": "How can you create a calculated column in Power BI?",
        "images": [],
        "choices": [
          "Use the Power BI Desktop",
          "Use the Power BI Service",
          "Use the Power BI Mobile App",
          "Use Excel"
        ],
        "correct": 0
    },
    {
        "id": "q042",
        "text": "You need to create a visualization that compares revenue and cost over time.Which type of visualization should you use?",
        "images": [],
        "choices": [
          "A. waterfall chart",
          "B. stacked area chart",
          "C. line chart",
          "D. donut chart"
        ],
        "correct": 2
    },
    {
        "id": "q043",
        "text": "You have a Power BI workspace that contains several reports.You need to provide a user with the ability to create a dashboard that will use the visuals from the reports.What should you do?",
        "images": [],
        "choices": [
          "A. Create a row-level security (RLS) role and add the user to the role.",
          "B. Share the reports with the user.",
          "C. Grant the Read permission for the datasets to the user.",
          "D. Add the user as a member of the workspace.",
          "E. Add the user as a Viewer of the workspace."
        ],
        "correct": 3
    },
    {
        "id": "q044",
        "text": "You need to create a data source that can be used offline. Which type of data source should you use?",
        "images": [],
        "choices": [
          "SQL Server",
          "Common Data Service",
          "SharePoint",
          "OneDrive"
        ],
        "correct": 3
    },
    {
        "id": "q045",
        "text": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.You have a Power BI report that imports a date table and a sales table from an Azure SQL database data source. The sales table has the following date foreign keys:✑ Due Date✑ Order Date✑ Delivery DateYou need to support the analysis of sales over time based on all the date foreign keys.Solution: From Power Query Editor, you rename the date query as Due Date. You reference the Due Date query twice to make the queries for Order Date andDelivery Date.Does this meet the goal?",
        "images": [],
        "choices": [
          "A. Yes",
          "B. No"
        ],
        "correct": 1
    }
]