[
    {
        "id": "q001",
        "text": "You need to import 45 Excel files to Power BI Desktop. All these files are in a unique desktop local folder and share the same structure. You want to import all these Excel files into a single table. Which of the following would help you in achieving the goal?",
        "ger_text": "Sie müssen 45 Excel-Dateien in Power BI Desktop importieren. Alle diese Dateien befinden sich in einem einzigen lokalen Ordner auf dem Desktop und haben die gleiche Struktur. Sie möchten alle diese Excel-Dateien in eine einzige Tabelle importieren. Welche der folgenden Optionen würde Ihnen helfen, dieses Ziel zu erreichen?",
        "images": [],
        "choices": [
            "Adding the folder data source; using the Append Queries command",
            "Adding the folder data source; using the Combine Files Command",
            "Adding every single file to the model and then using Merge Query Command",
            "Adding the MS Excel Data Source; selecting all files of the folder",
            "Adding a folder data source and using the Merge Queries Command"
        ],
        "ger_choices": [
            "Hinzufügen der Ordner-Datenquelle; Verwenden des Befehls 'Abfragen anhängen'",
            "Hinzufügen der Ordner-Datenquelle; Verwenden des Befehls 'Dateien kombinieren'",
            "Hinzufügen jeder einzelnen Datei zum Modell und anschließendes Verwenden des Befehls 'Abfragen zusammenführen'",
            "Hinzufügen der MS Excel-Datenquelle; Auswählen aller Dateien im Ordner",
            "Hinzufügen einer Ordner-Datenquelle und Verwenden des Befehls 'Abfragen zusammenführen'"
        ],
        "correct": 1
    },
    {
        "id": "q002",
        "text": "You have a 200 GB data warehouse that has data consolidated from several applications and runs on SQL Server 2017 Enterprise Edition. You notice that with your reports, there is a default limitation of eight daily refreshes. Your manager asks you to ensure that the reports are never more outdated than 1 hour. Which of the following can help you in achieving the same?",
        "ger_text": "Sie haben ein 200 GB großes Data Warehouse, das Daten aus mehreren Anwendungen konsolidiert und auf SQL Server 2017 Enterprise Edition läuft. Ihnen fällt auf, dass bei Ihren Berichten eine Standardbeschränkung von acht täglichen Aktualisierungen besteht. Ihr Manager bittet Sie sicherzustellen, dass die Berichte nie älter als 1 Stunde sind. Welche der folgenden Optionen kann Ihnen dabei helfen, dies zu erreichen?",
        "images": [],
        "choices": [
            "Building an application for monitoring the changes in the database and pushing them out utilizing the real-time streaming API",
            "Migrating the content to Power BI Premium",
            "Adding an SSAS tabular layer on top and enabling the Live connections",
            "Convert to DirectQuery to access the data warehouse"
        ],
        "ger_choices": [
            "Entwicklung einer Anwendung zur Überwachung der Änderungen in der Datenbank und Übertragung dieser Änderungen mithilfe der Echtzeit-Streaming-API",
            "Migration der Inhalte zu Power BI Premium",
            "Hinzufügen einer SSAS-Tabellenschicht (SQL Server Analysis Services) und Aktivieren von Live-Verbindungen",
            "Umstellung auf DirectQuery, um auf das Data Warehouse zuzugreifen"
        ],
        "correct": 1
    },
    {
        "id": "q003",
        "text": "Consider the statement below. Row Level Security can’t be applied in Power BI Desktop while connecting via a Live connection to Analysis Services, these need to be set within the AS model.",
        "ger_text": "Betrachten Sie die folgende Aussage: Row-Level-Sicherheit (RLS) kann in Power BI Desktop nicht angewendet werden, wenn über eine Live-Verbindung zu Analysis Services verbunden wird. Diese muss innerhalb des AS-Modells festgelegt werden.",
        "images": [],
        "choices": ["true", "false"],
        "ger_choices": ["Wahr", "Falsch"],
        "correct": 0
    },
    {
        "id": "q004",
        "text": "Can you create a relationship between two columns having different DATA TYPE?",
        "ger_text": "Können Sie eine Beziehung zwischen zwei Spalten mit unterschiedlichen DATENTYPEN erstellen?",
        "images": [],
        "choices": [
            "Yes, but the cardinality of the relationship needs to set as one to many",
            "Yes, but the cardinality of the relationship needs to set as many to many",
            "Yes, the latest versions of Power BI Desktops fully support creating relationships between such columns",
            "No, the columns in a relationship need to share the same data type"
        ],
        "ger_choices": [
            "Ja, aber die Kardinalität der Beziehung muss auf 'Eins-zu-Viele' festgelegt werden.",
            "Ja, aber die Kardinalität der Beziehung muss auf 'Viele-zu-Viele' festgelegt werden.",
            "Ja, die neuesten Versionen von Power BI Desktop unterstützen die Erstellung von Beziehungen zwischen solchen Spalten vollständig.",
            "Nein, die Spalten in einer Beziehung müssen denselben Datentyp haben."
        ],
        "correct": 3
    },
    {
        "id": "q005",
        "text": "You need to configure a Gauge chart. Where would you set the goal for this?",
        "ger_text": "Sie müssen ein Messdiagramm (Gauge Chart) konfigurieren. Wo würden Sie das Ziel dafür festlegen?",
        "images": [],
        "choices": [
            "Format Settings",
            "Power Query",
            "Calculated Column",
            "DAX Expression"
        ],
        "ger_choices": [
            "Formateinstellungen",
            "Power Query",
            "Berechnete Spalte",
            "DAX-Ausdruck"
        ],
        "correct": 0
    }
]
